#!/usr/bin/env
import prompt
import brain_games.cli as cli

def main():
    print('''
-----------------------------------
|   Welcome to the Brain Games!   |
| Добро пожаловать в Игры Разума! |
-----------------------------------
|           _---~~(~~-_.	  |
|         _{  BRAIN )   )	  |
|       ,   ) -~~- ( ,-' )_	  |
|      (  `-,_..`., )-- '_,)	  |
|     ( ` _)  (  -~( -_ `,  }	  |
|     (_-  _  ~_-~~~~`,  ,' )	  |
|       `~ -^(    __;-,((()))	  |
|             ~~~~ {_ -_(())	  |
|                    `\  }	  |
-----------------------------------
''')
    cli.welcome_user()

if __name__ == '__main__':
    main()
