#!/usr/bin/env
from brain_games.cli import welcome_user


def main():
    print('''
-----------------------------------
|   Welcome to the Brain Games!   |
| Добро пожаловать в Игры Разума! |
-----------------------------------
|           _---~~(~~-_.	  |
|         _{  BRAIN )   )	  |
|       ,   ) -~~- ( ,-' )_	  |
|      (  `-,_..`., )-- '_,)	  |
|     ( ` _)  (  -~( -_ `,  }	  |
|     (_-  _  ~_-~~~~`,  ,' )	  |
|       `~ -^(    __;-,((()))	  |
|             ~~~~ {_ -_(())	  |
|                    `\\  }	  |
-----------------------------------
''')
    welcome_user()


if __name__ == '__main__':
    main()
